{
  "name": "antsAlignOrigin",
  "command-line": "antsAlignOrigin [DIMENSIONALITY] [INPUT] [REFERENCE_IMAGE] [OUTPUT]",
  "description": "Advanced Normalization Tools (ANTs) is a C++ library available through the command line that computes high-dimensional mappings to capture the statistics of brain structure and function. It allows one to organize, visualize and statistically explore large biomedical image sets. Additionally, it integrates imaging modalities in space + time and works across species or organ systems with minimal customization.\n\nThe ANTs library is considered a state-of-the-art medical image registration and segmentation toolkit which depends on the Insight ToolKit, a widely used medical image processing library to which ANTs developers contribute. ANTs-related tools have also won several international, unbiased competitions such as MICCAI, BRATS, and STACOM.",
  "tool-version": "2.5.3",
  "schema-version": "0.5",
  "inputs": [
    {
      "id": "dimensionality",
      "name": "Dimensionality",
      "value-key": "[DIMENSIONALITY]",
      "type": "Number",
      "integer": true,
      "optional": true,
      "value-choices": [
        2,
        3
      ],
      "command-line-flag": "--dimensionality",
      "description": "This option forces the image to be treated as a specified-dimensional image. If not specified, antsWarp tries to infer the dimensionality from the input image."
    },
    {
      "id": "input",
      "name": "Input image",
      "value-key": "[INPUT]",
      "type": "File",
      "optional": false,
      "command-line-flag": "--input",
      "description": "Currently, the only input objects supported are image objects. However, the current framework allows for warping of other objects such as meshes and point sets."
    },
    {
      "id": "reference_image",
      "name": "Reference image",
      "value-key": "[REFERENCE_IMAGE]",
      "type": "File",
      "optional": false,
      "command-line-flag": "--reference-image",
      "description": "For warping input images, the reference image defines the spacing, origin, size, and direction of the output warped image."
    },
    {
      "id": "output",
      "name": "Output",
      "value-key": "[OUTPUT]",
      "type": "File",
      "optional": false,
      "command-line-flag": "--output",
      "description": "One can either output the warped image or, if the boolean is set, one can print out the displacement field based on the composite transform and the reference image."
    }
  ],
  "output-files": [
    {
      "id": "aligned_image",
      "name": "Aligned Image",
      "description": "The output is the aligned image.",
      "path-template": "[OUTPUT]"
    }
  ],
  "author": "ANTs developers",
  "url": "https://github.com/ANTsX/ANTs",
  "container-image": {
    "type": "docker",
    "image": "antsx/ants:v2.5.3"
  }
}