{
  "name": "afdconnectivity",
  "synopsis": "Obtain an estimate of fibre connectivity between two regions using AFD and streamlines tractography",
  "requires_at_least_one_argument": true,
  "author": "David Raffelt (david.raffelt@florey.edu.au) and Robert E. Smith (robert.smith@florey.edu.au)",
  "version": "3.0.4",
  "copyright": "Copyright (c) 2008-2024 the MRtrix3 contributors.\n\nThis Source Code Form is subject to the terms of the Mozilla Public\nLicense, v. 2.0. If a copy of the MPL was not distributed with this\nfile, You can obtain one at http://mozilla.org/MPL/2.0/.\n\nCovered Software is provided under this License on an \"as is\"\nbasis, without warranty of any kind, either expressed, implied, or\nstatutory, including, without limitation, warranties that the\nCovered Software is free of defects, merchantable, fit for a\nparticular purpose or non-infringing.\nSee the Mozilla Public License v. 2.0 for more details.\n\nFor more details, see http://www.mrtrix.org/.\n",
  "description": [
     "This estimate is obtained by determining a fibre volume (AFD) occupied by the pathway of interest, and dividing by the streamline length.",
     "If only the streamlines belonging to the pathway of interest are provided, then ALL of the fibre volume within each fixel selected will contribute to the result. If the -wbft option is used to provide whole-brain fibre-tracking (of which the pathway of interest should contain a subset), only the fraction of the fibre volume in each fixel estimated to belong to the pathway of interest will contribute to the result.",
     "Use -quiet to suppress progress messages and output fibre connectivity value only.",
     "For valid comparisons of AFD connectivity across scans, images MUST be intensity normalised and bias field corrected, and a common response function for all subjects must be used.",
     "Note that the sum of the AFD is normalised by streamline length to account for subject differences in fibre bundle length. This normalisation results in a measure that is more related to the cross-sectional volume of the tract (and therefore 'connectivity'). Note that SIFT-ed tract count is a superior measure because it is unaffected by tangential yet unrelated fibres. However, AFD connectivity may be used as a substitute when Anatomically Constrained Tractography is not possible due to uncorrectable EPI distortions, and SIFT may therefore not be as effective.",
     "Longer discussion regarding this command can additionally be found at: https://mrtrix.readthedocs.io/en/3.0.4/concepts/afd_connectivity.html (as well as in the relevant reference)."
  ],
  "references": [
     "Smith, R. E.; Raffelt, D.; Tournier, J.-D.; Connelly, A. Quantitative Streamlines Tractography: Methods and Inter-Subject Normalisation. Open Science Framework, https://doi.org/10.31219/osf.io/c67kn."
  ],
  "examples": [
  ],
  "arguments": [
    {
      "id": "image",
      "description": "the input FOD image.",
      "type": "image in",
      "optional": false,
      "allow_multiple": false
    },
    {
      "id": "tracks",
      "description": "the input track file defining the bundle of interest.",
      "type": "tracks in",
      "optional": false,
      "allow_multiple": false
    }
  ],
  "option_groups": [
    {
      "name": "OPTIONS",
      "options": [
        {
          "id": "wbft",
          "description": "provide a whole-brain fibre-tracking data set (of which the input track file should be a subset), to improve the estimate of fibre bundle volume in the presence of partial volume",
          "optional": true,
          "allow_multiple": false,
          "arguments": [
            {
              "id": "tracks",
              "description": "",
              "type": "tracks in",
              "optional": false,
              "allow_multiple": false
            }
          ]
        },
        {
          "id": "afd_map",
          "description": "output a 3D image containing the AFD estimated for each voxel.",
          "optional": true,
          "allow_multiple": false,
          "arguments": [
            {
              "id": "image",
              "description": "",
              "type": "image out",
              "optional": false,
              "allow_multiple": false
            }
          ]
        },
        {
          "id": "all_fixels",
          "description": "if whole-brain fibre-tracking is NOT provided, then if multiple fixels within a voxel are traversed by the pathway of interest, by default the fixel with the greatest streamlines density is selected to contribute to the AFD in that voxel. If this option is provided, then ALL fixels with non-zero streamlines density will contribute to the result, even if multiple fixels per voxel are selected.",
          "optional": true,
          "allow_multiple": false,
          "arguments": [
          ]
        }
      ]
    },
    {
      "name": "__standard_options",
      "options": [
        {
          "id": "info",
          "description": "display information messages.",
          "optional": true,
          "allow_multiple": false,
          "arguments": [
          ]
        },
        {
          "id": "quiet",
          "description": "do not display information messages or progress status; alternatively, this can be achieved by setting the MRTRIX_QUIET environment variable to a non-empty string.",
          "optional": true,
          "allow_multiple": false,
          "arguments": [
          ]
        },
        {
          "id": "debug",
          "description": "display debugging messages.",
          "optional": true,
          "allow_multiple": false,
          "arguments": [
          ]
        },
        {
          "id": "force",
          "description": "force overwrite of output files (caution: using the same file as input and output might cause unexpected behaviour).",
          "optional": true,
          "allow_multiple": false,
          "arguments": [
          ]
        },
        {
          "id": "nthreads",
          "description": "use this number of threads in multi-threaded applications (set to 0 to disable multi-threading).",
          "optional": true,
          "allow_multiple": false,
          "arguments": [
            {
              "id": "number",
              "description": "",
              "type": "integer",
              "optional": false,
              "allow_multiple": false
            }
          ]
        },
        {
          "id": "config",
          "description": "temporarily set the value of an MRtrix config file entry.",
          "optional": true,
          "allow_multiple": true,
          "arguments": [
            {
              "id": "key",
              "description": "",
              "type": "text",
              "optional": false,
              "allow_multiple": false
            },
            {
              "id": "value",
              "description": "",
              "type": "text",
              "optional": false,
              "allow_multiple": false
            }
          ]
        },
        {
          "id": "help",
          "description": "display this information page and exit.",
          "optional": true,
          "allow_multiple": false,
          "arguments": [
          ]
        },
        {
          "id": "version",
          "description": "display version information and exit.",
          "optional": true,
          "allow_multiple": false,
          "arguments": [
          ]
        }
      ]
    }
  ]
}
